lvx/base/DataProcessors/бит_му_НастройкиРасчетаОтложенныхНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_му_НастройкиРасчетаОтложенныхНалогов</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

lvx/base/InformationRegisters/бит_му_НастройкиРасчетаОтложенныхНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_НастройкиРасчетаОтложенныхНалогов</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктивовОбязательств</Name>
					<Comment>Вид активов/обязательств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_му_ВидыАктивовОбязательств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Comment>Источник данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_ТипыИсточниковДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыИсточниковДанных</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отчетность</Name>
					<Comment>Унверсальные отчеты; Заполнение значений произвольных параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенныеНалогиМСФО</Name>
					<Comment>Отложенные налоги МСФО</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентированнаяОтчетность</Name>
					<Comment>Регламентированная отчетность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентноеЗакрытие</Name>
					<Comment>Регламентное закрытие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеФакта</Name>
					<Comment>Получение факта</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Элиминация</Name>
					<Comment>Элиминация</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/DataProcessors/бит_му_НастройкиРасчетаОтложенныхНалогов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	МетаданныеОбъекта = Метаданные.Обработки.бит_му_НастройкиРасчетаОтложенныхНалогов;
	// Вызов механизма защиты
	
	
	ЗаполнитьКэшЗначений();
	
	ОбновлятьАвтоматически = Истина;
	
	СчетчикИдГруппы = 0;
	ИдГруппы 		= 0;
	
	Период = ТекущаяДата();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДерево();
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если ОбновлятьАвтоматически Тогда
		ОбновитьДерево();
	КонецЕсли;
	
КонецПроцедуры // ПериодПриИзменении()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ОбновлятьАвтоматически Тогда
		ОбновитьДерево();
	КонецЕсли;
	
КонецПроцедуры // ОрганизацияПриИзменении()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревонастроек

&НаКлиенте
Процедура ДеревоНастроекВидАктивовОбязательствНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
		 	
	Отбор = Новый Структура("Родитель", ТекущиеДанные.Группа);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("ТекущийЭлемент", ТекущиеДанные.ВидАктивовОбязательств);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.бит_му_ВидыАктивовОбязательств.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры // ДеревоНастроекВидАктивовОбязательствНачалоВыбора()

&НаКлиенте
Процедура ДеревоНастроекИсточникДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
	ИсточникДанных = ТекущиеДанные.ИсточникДанных;
	 	
	Отбор = Новый Структура("ТипИсточника", фКэшЗначений.ТипОтложенныеНалогиМСФО);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("ТекущийЭлемент", ИсточникДанных);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.бит_ИсточникиДанных.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры // ДеревоНастроекИсточникДанныхНачалоВыбора()

&НаКлиенте
Процедура ДеревоНастроекИсточникДанныхПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;	
	Если ТекущиеДанные <> Неопределено Тогда		
		СтруктураДанных = ПараметрыИзменяемыхДанных(ТекущиеДанные); 
		ЗафиксироватьИзменения(СтруктураДанных);	
		ТекущиеДанные.Изменено = Истина;		
	КонецЕсли; 
	
КонецПроцедуры // ДеревоНастроекИсточникДанныхПриИзменении()

&НаКлиенте
Процедура ДеревоНастроекКромеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;	
	Если ТекущиеДанные <> Неопределено Тогда		
		СтруктураДанных = ПараметрыИзменяемыхДанных(ТекущиеДанные); 
		ЗафиксироватьИзменения(СтруктураДанных);	
		ТекущиеДанные.Изменено = Истина;		
	КонецЕсли; 
	
КонецПроцедуры // ДеревоНастроекКромеПриИзменении()

&НаКлиенте
Процедура ДеревоНастроекПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;	
	Если ТекущиеДанные <> Неопределено Тогда		
		ТекущиеДанные.ИсточникДанных = фКэшЗначений.ПустойИсточник;		
		СтруктураДанных = ПараметрыИзменяемыхДанных(ТекущиеДанные);
		ЗафиксироватьИзменения(СтруктураДанных);	
		ТекущиеДанные.Изменено = Истина;		
	КонецЕсли;
	
КонецПроцедуры // ДеревоНастроекПередУдалением()

&НаКлиенте
Процедура ДеревоНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда // Копирование
			
		Отказ = Истина;
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено 
			И  Не ТекущиеДанные.ЭтоГруппа Тогда 
   			
			// Добавляем новую строку дерева
			СтрокаДерева 	   = ДобавитьСтрокуДерева(ТекущиеДанные);
			
			// Заполняем строку дерева
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Элемент.ТекущиеДанные);
			СтрокаДерева.ИсточникДанных  = фКэшЗначений.ПустойИсточник;
			СтрокаДерева.ТекущийИсточник = фКэшЗначений.ПустойИсточник;
			     		
		КонецЕсли; 
		
	Иначе // Добавление
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			
			Отказ = Истина;
			
			// Добавляем новую строку дерева
			СтрокаДерева 	   = ДобавитьСтрокуДерева(ТекущиеДанные);			
			
		КонецЕсли;
	
	КонецЕсли; 
	
	Элементы.ДеревоНастроек.Обновить();
	
КонецПроцедуры // ДеревоНастроекПередНачаломДобавления()

&НаКлиенте
Процедура ДеревоНастроекПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.ЭтоГруппа Тогда
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры // ДеревоНастроекПередНачаломИзменения()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьДерево();
	
КонецПроцедуры // Обновить()

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьИзмененияВРегистр();
	
	УстановитьНеИзменено(ДеревоНастроек);
	
КонецПроцедуры // Записать()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет кэш значений.
// 
// Параметры:
//  Нет
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	фКэшЗначений = Новый Структура;

	фКэшЗначений.Вставить("ТипОтложенныеНалогиМСФО", Перечисления.бит_ТипыИсточниковДанных.ОтложенныеНалогиМСФО);
    фКэшЗначений.Вставить("ПустойИсточник", Справочники.бит_ИсточникиДанных.ПустаяСсылка());

КонецПроцедуры // ЗаполнитьКэшЗначений()

// Функция получает записи регистра сведений бит_му_НастройкиРасчетаОтложенныхНалогов.
// 
&НаСервере
Процедура ЗаполнитьДеревоНастроек()
	
	ТаблицаИзменений.Очистить();
	ДанныеДерева = ЭтотОбъект.ДеревоНастроек.ПолучитьЭлементы();
	ДанныеДерева.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВидыАктивов.Ссылка КАК ВидАктивовОбязательств,
	               |	ВидыАктивов.ЭтоГруппа,
	               |	ВидыАктивов.Родитель КАК Группа,
	               |	Настройки.ИсточникДанных,
	               |	Настройки.ИсточникДанных КАК ТекущийИсточник,
	               |	Настройки.Период,
	               |	ВЫБОР
	               |		КОГДА Настройки.ИсточникДанных = ЗНАЧЕНИЕ(Справочник.бит_ИсточникиДанных.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Кроме
	               |ИЗ
	               |	Справочник.бит_му_ВидыАктивовОбязательств КАК ВидыАктивов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_НастройкиРасчетаОтложенныхНалогов.СрезПоследних(&Период, Организация = &Организация) КАК Настройки
	               |		ПО ВидыАктивов.Ссылка = Настройки.ВидАктивовОбязательств
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидыАктивов.Ссылка ИЕРАРХИЯ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	НомерСтроки = 0;
	ДобавитьУровень(Выборка, ДеревоНастроек, НомерСтроки);
	
	КоличествоСтрок = КоличествоСтрок + НомерСтроки;
	
	Элементы.ДеревоНастроек.НачальноеОтображениеДерева    = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
КонецПроцедуры // ПроверитьВозможностьЗаписи()

// Процедура заполняет значениями строку дерева.
// 
// Параметры:
//  Выборка  - Выборка из результата запроса.
//  Строка   - ДанныеФормыДерево.
// 
&НаСервере
Функция ДобавитьУровень(ВыборкаУзел, Строка, НомерСтроки, УменьшитьИдГрупп = Ложь)
	
	Пока ВыборкаУзел.Следующий() Цикл
			
		ЭтоГруппа = ВыборкаУзел.ЭтоГруппа;
		
		КоллекцияЭлементов = Строка.ПолучитьЭлементы();

	    ЭлементДерева = КоллекцияЭлементов.Добавить();
	    ЗаполнитьЗначенияСвойств(ЭлементДерева, ВыборкаУзел);
		
		Если ЭтоГруппа Тогда
			ИдГруппы = СчетчикИд;
			ЭлементДерева.ИдГруппы = ИдГруппы;
		Иначе
		    ЭлементДерева.ИдГруппы = ИдГруппы;
		КонецЕсли;
		СчетчикИд = СчетчикИд + 1;
		
		ЭлементДерева.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		
		// Картинка группы или элемента
		Если ЭлементДерева.ВидАктивовОбязательств.ЭтоГруппа Тогда
			ЭлементДерева.Картинка = БиблиотекаКартинок.бит_Казна_Папка;
		Иначе
			ЭлементДерева.Картинка = БиблиотекаКартинок.бит_Реквизит;
		КонецЕсли; 
		
		// Вывод подуровней
		Выборка = ВыборкаУзел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	    ДобавитьУровень(Выборка, ЭлементДерева, НомерСтроки, ЭтоГруппа);
					
	КонецЦикла;
		
	Если УменьшитьИдГрупп Тогда
		
		ИдГруппы = ИдГруппы - 1;	
	
	КонецЕсли;
    		
КонецФункции // ДобавитьУровень()

// Процедура фиксирует изменение прав пользователя в таблице изменений.
// 
// Параметры:
//  СтруктураДанных    - Структура.
// 
&НаСервере
Процедура ЗафиксироватьИзменения(СтруктураДанных)

	СтрокаСуществует = Ложь;
	
	мТаблицаИзменений = РеквизитФормыВЗначение("ТаблицаИзменений"); 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидАктивовОбязательств", СтруктураДанных.ВидАктивовОбязательств);
	СписокСтрок = мТаблицаИзменений.НайтиСтроки(Отбор);
	Для каждого Строка Из СписокСтрок Цикл
		Если Строка.ТекущийИсточник = СтруктураДанных.ТекущийИсточник Тогда
			Строка.ИсточникДанных   = СтруктураДанных.ИсточникДанных;
			Строка.Период 			= СтруктураДанных.Период;
			Строка.Кроме			= СтруктураДанных.Кроме;
			СтрокаСуществует = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	Если Не СтрокаСуществует Тогда
		СтрокаИзменений = мТаблицаИзменений.Добавить();
		СтрокаИзменений.ВидАктивовОбязательств = СтруктураДанных.ВидАктивовОбязательств;
		СтрокаИзменений.ТекущийИсточник 	   = СтруктураДанных.ТекущийИсточник;
		СтрокаИзменений.ИсточникДанных 		   = СтруктураДанных.ИсточникДанных;
		СтрокаИзменений.Кроме				   = СтруктураДанных.Кроме;
		СтрокаИзменений.Период 				   = ?(ЗначениеЗаполнено(СтруктураДанных.Период), 
													СтруктураДанных.Период,
													Период);
	КонецЕсли; 
	
	ЗначениеВДанныеФормы(мТаблицаИзменений, ТаблицаИзменений);
   	
КонецПроцедуры // ЗафиксироватьИзменения()

// Процедура записывает установленные права
// в регистр сведений бит_НастройкиДополнительныхПравПользователей.
// 
&НаСервере
Процедура ЗаписатьИзмененияВРегистр()

	Если Не ЗначениеЗаполнено(Период) Тогда
		ТекстСообщения = НСтр("ru='Период не может быть пустым';en='Period can not be empty'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	мТаблицаИзменений = РеквизитФормыВЗначение("ТаблицаИзменений"); 

	Для каждого Строка Из мТаблицаИзменений Цикл
		
		МенеджерЗаписи = РегистрыСведений.бит_му_НастройкиРасчетаОтложенныхНалогов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период   	 		  = Строка.Период;
		МенеджерЗаписи.Организация   		  = Организация;
		МенеджерЗаписи.ВидАктивовОбязательств = Строка.ВидАктивовОбязательств;
		МенеджерЗаписи.ИсточникДанных 		  = Строка.ТекущийИсточник;
		МенеджерЗаписи.Удалить();
		
		Если ЗначениеЗаполнено(Строка.ИсточникДанных) ИЛИ Строка.Кроме Тогда
			МенеджерЗаписи = РегистрыСведений.бит_му_НастройкиРасчетаОтложенныхНалогов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период   	 		  = ?(ЗначениеЗаполнено(Строка.Период), 
													Строка.Период, 
													НачалоМесяца(Период));
			МенеджерЗаписи.Организация   		  = Организация;
			МенеджерЗаписи.ВидАктивовОбязательств = Строка.ВидАктивовОбязательств;
			МенеджерЗаписи.ИсточникДанных   	  = Строка.ИсточникДанных;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
		Строка.ТекущийИсточник = Строка.ИсточникДанных;
  					
	КонецЦикла; 
	
	мТаблицаИзменений.Очистить();
	ЗначениеВДанныеФормы(мТаблицаИзменений, ТаблицаИзменений);

КонецПроцедуры // ЗаписатьИзмененияВРегистр()

// Процедура обновляет дерево настроек
// 
&НаКлиенте
Процедура ОбновитьДерево()
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Возврат;
	КонецЕсли;
	
	КоличствоПредыдущее = КоличествоСтрок;
	
	ЗаполнитьДеревоНастроек();
	
	// Раскрываем все уровни
	КоличествоВерхнихСтрок = ЭтотОбъект.ДеревоНастроек.ПолучитьЭлементы().Количество();
	Для i = 0 По (КоличествоВерхнихСтрок - 1) Цикл
		
		СтрокаДерева = ЭтотОбъект.ДеревоНастроек.ПолучитьЭлементы()[i];
		Элементы.ДеревоНастроек.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
			
	КонецЦикла;
	
КонецПроцедуры // ОбновитьДерево()

// Процедура сбрасывает все значения элемента "Изменено" таблицы значений в Ложь.
// 
// Параметры:
//  СтрокаДерева  - Данные формы Дерево.
// 
&НаКлиенте
Процедура УстановитьНеИзменено(СтрокаДерева)

	КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементов Цикл  
		
		Строка.Изменено = Ложь;
				
		УстановитьНеИзменено(Строка);
		
	КонецЦикла; 	

КонецПроцедуры // УстановитьНеИзменено()

// Функция добавляет строку дерева в нужную группу.
// 
// Параметры:
//  ТекущиеДанные  - Текущие данные табличного поля ДеревоНастроек.
//  
// Возвращаемое значение:
//   Строка дерева значений.
// 
&НаКлиенте
Функция ДобавитьСтрокуДерева(ТекущиеДанные)
	
	ИдГруппы 	 = ТекущиеДанные.ИдГруппы;
	Группа		 = ТекущиеДанные.Группа;
	Если ЗначениеЗаполнено(ТекущиеДанные.Группа) Тогда
		СтрокаГруппы = ДеревоНастроек.НайтиПоИдентификатору(ИдГруппы);
		КоллекцияЭлементов = СтрокаГруппы.ПолучитьЭлементы();
	Иначе	
	    КоллекцияЭлементов = ДеревоНастроек.ПолучитьЭлементы();
	КонецЕсли;
	 
	
	// Добавляем новую строку дерева
	СтрокаДерева 	   = КоллекцияЭлементов.Добавить();
	СтрокаДерева.ИдГруппы = ИдГруппы;
	СтрокаДерева.Группа   = Группа;
	СтрокаДерева.Картинка = БиблиотекаКартинок.бит_Реквизит;
	СтрокаДерева.Изменено = Истина;
	
	СчетчикИд 		= СчетчикИд + 1;
	КоличествоСтрок = КоличествоСтрок + 1;
			
	Возврат СтрокаДерева;
	
КонецФункции // ДобавитьСтрокуДерева()

// Функция заполняет структуру изменяемой строки.
// 
// Параметры:
//  ТекущиеДанные  - ТекущиеДанные
//
// Возвращаемое значение:
//  Структура.
// 
&НаКлиенте
Функция ПараметрыИзменяемыхДанных(ТекущиеДанные)

	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("ВидАктивовОбязательств", ТекущиеДанные.ВидАктивовОбязательств);
	ПараметрыДанных.Вставить("ИсточникДанных"		 , ТекущиеДанные.ИсточникДанных);
	ПараметрыДанных.Вставить("ТекущийИсточник"		 , ТекущиеДанные.ТекущийИсточник);
	ПараметрыДанных.Вставить("Период"				 , ТекущиеДанные.Период);
	ПараметрыДанных.Вставить("Кроме"				 , ТекущиеДанные.Кроме);
	
	Возврат ПараметрыДанных; 
	
КонецФункции // ПараметрыИзменяемыхДанных()
									
#КонецОбласти
